; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v13)
             (pred_6 ?v9 ?v8)
             (pred_12 ?v4 ?v8)
             (pred_11 ?v10 ?v4 )
	     (pred_1 ?v4)
             (pred_7 ?v11)
             (pred_3 ?v9)
             (pred_8 ?v8)
             (pred_4 ?v4)
             (pred_5 ?v9)
             (pred_9 ?v4)
             (pred_2 ))



(:action op_1
:parameters (?v7 ?v12 ?v1 ?v6)
:precondition (and (pred_7 ?v7) (pred_7 ?v12) (pred_3 ?v1) (pred_8 ?v6)
          (pred_10 ?v7 ?v12) (pred_6 ?v1 ?v6)
                   (pred_12 ?v12 ?v6) (pred_1 ?v7) 
                   (pred_4 ?v12) (pred_5 ?v1))
:effect (and  (pred_9 ?v12) (not (pred_4 ?v12))))


(:action op_5
:parameters (?v7 ?v2)
:precondition (and (pred_7 ?v7) (pred_7 ?v2)
               (pred_1 ?v7) (pred_10 ?v7 ?v2) (pred_9 ?v2))
:effect (and (pred_1 ?v2) (not (pred_1 ?v7))))

(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_7 ?v7) (pred_3 ?v1) 
                  (pred_1 ?v7) (pred_11 ?v1 ?v7) (pred_2 ))
:effect (and (pred_5 ?v1)
   (not (pred_11 ?v1 ?v7)) (not (pred_2 ))))


(:action op_3
:parameters (?v7 ?v5 ?v3)
:precondition (and (pred_7 ?v7) (pred_3 ?v5) (pred_3 ?v3)
                  (pred_1 ?v7) (pred_5 ?v3) (pred_11 ?v5 ?v7))
:effect (and (pred_5 ?v5) (pred_11 ?v3 ?v7)
        (not (pred_5 ?v3)) (not (pred_11 ?v5 ?v7))))

(:action op_4
:parameters (?v7 ?v1)
:precondition (and (pred_7 ?v7) (pred_3 ?v1) 
                  (pred_1 ?v7) (pred_5 ?v1))
:effect (and (pred_2 ) (pred_11 ?v1 ?v7) (not (pred_5 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_08 obj_02 obj_15 obj_04 obj_16 obj_19 obj_11 obj_13 obj_18 obj_20 obj_01 obj_17 obj_06 obj_09 obj_10
    obj_14 obj_07
    obj_03 obj_12
    )

    (:init
       (pred_2)

       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_02)
       (pred_7 obj_15)
       (pred_7 obj_04)
       (pred_7 obj_16)
       (pred_7 obj_19)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_17)
       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_7 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_07)
       (pred_3 obj_03)
       (pred_3 obj_12)

       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_13 obj_17)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_17 obj_06)
       (pred_10 obj_17 obj_13)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_06 obj_17)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_12  obj_08 obj_14)
       (pred_12  obj_11 obj_07)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_9 obj_10)

       (pred_6  obj_03 obj_14)
       (pred_6  obj_12 obj_07)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_12 obj_01)
       (pred_1 obj_15)
    )

    (:goal (and
       (pred_11 obj_12 obj_18)
    ))
(:constraints
  (always (not (pred_1 obj_20)))
)
)

; plan
1. (op_5 obj_15 obj_02)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_02)
   goals met: 0 of 1
2. (op_2 obj_02 obj_03)
   deleted: (pred_11 obj_03 obj_02) (pred_2)
   added: (pred_5 obj_03)
   goals met: 0 of 1
3. (op_5 obj_02 obj_19)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_19)
   goals met: 0 of 1
4. (op_5 obj_19 obj_16)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_16)
   goals met: 0 of 1
5. (op_5 obj_16 obj_18)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_18)
   goals met: 0 of 1
6. (op_4 obj_18 obj_03)
   deleted: (pred_5 obj_03)
   added: (pred_2) (pred_11 obj_03 obj_18)
   goals met: 0 of 1
7. (op_5 obj_18 obj_06)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_09)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_09)
   goals met: 0 of 1
9. (op_5 obj_09 obj_10)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_10)
   goals met: 0 of 1
10. (op_5 obj_10 obj_01)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_01)
   goals met: 0 of 1
11. (op_2 obj_01 obj_12)
   deleted: (pred_11 obj_12 obj_01) (pred_2)
   added: (pred_5 obj_12)
   goals met: 0 of 1
12. (op_5 obj_01 obj_10)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_10)
   goals met: 0 of 1
13. (op_5 obj_10 obj_09)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_09)
   goals met: 0 of 1
14. (op_5 obj_09 obj_06)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_06)
   goals met: 0 of 1
15. (op_5 obj_06 obj_18)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_18)
   goals met: 0 of 1
16. (op_3 obj_18 obj_03 obj_12)
   deleted: (pred_5 obj_12) (pred_11 obj_03 obj_18)
   added: (pred_5 obj_03) (pred_11 obj_12 obj_18)
   goals met: 1 of 1
